<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>PAckages the latest version of Panoramix.</string>
	<key>Identifier</key>
	<string>com.github.orbsmiv.pkg.Panoramix</string>
	<key>Input</key>
	<dict>
		<key>USERNAME</key>
		<string>username</string>
		<key>PASSWORD</key>
		<string>password</string>
		<key>NAME</key>
		<string>IrcamPanoramix</string>
		<key>BUNDLE_ID</key>
		<string>fr.ircam.Panoramix</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.orbsmiv.download.Panoramix</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0755</string>
					<key>Applications/Ircam Panoramix</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/</string>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Ircam Panoramix/</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgname</key>
				<string>%NAME%-%version%</string>
				<key>pkg_request</key>
				<dict>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>id</key>
					<string>%BUNDLE_ID%</string>
					<key>version</key>
					<string>%version%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
